// Задача 6

Console.WriteLine("Введите значение x= ");
int x = int.Parse(Console.ReadLine());

if (x%2==0)
{
    Console.WriteLine("четное");
}

else
{
    Console.WriteLine("нечетное");

}



